app/controllers/api/v1/diagrams_controller.rb

SELECT  `diagrams`.* FROM `diagrams`  WHERE `diagrams`.`company_id` = 1 LIMIT 1
SELECT `columns`.* FROM `columns`  WHERE `columns`.`table_id` IN (1, 2)
---
    def index
      @diagrams = Diagram.includes(tables: [:columns, :referenced, :references]).where(company_id: current_company)

SELECT `tables`.* FROM `tables`
SELECT  `diagram_tables`.* FROM `diagram_tables`  WHERE `diagram_tables`.`diagram_id` = 1 AND `diagram_tables`.`table_id` = 1 LIMIT 1
---
    def load_diagram_settings(diagram_list)
      diagram_list.each do |d|
        if (d.name == "Default")
          d.active = true
        end

        d.tables.each do |t|
          t.diagram_settings = DiagramTable.find_by(:diagram_id => d.id, :table_id => t.id)