app/controllers/api/v1/tables_controller.rb

    def index
      @tables = Table.includes(:columns).all
---
SELECT `columns`.* FROM `columns`  WHERE `columns`.`table_id` IN (1, 2)
SELECT `tables`.* FROM `tables`  WHERE `tables`.`id` IN (1, 2)